---
kind: property
id: P:Autodesk.Revit.DB.MEPSystemType.FillPatternId
source: html/cc5413da-3984-5580-8303-70d790118cf3.htm
---
# Autodesk.Revit.DB.MEPSystemType.FillPatternId Property

Indicates the fill pattern id that should override the fill pattern id for all components in the system.

## Syntax (C#)
```csharp
public ElementId FillPatternId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null